// components/Topmove/Topmove.js
Component({
  /**
   * 组件的属性列表
   */
  properties: {

  },

  /**
   * 组件的初始数据
   */
  data: {
    TopMove:[{

      name:"旅行会让人谦卑，你会知道地球之大、"
    },
      {
        name: "永远有着与你截然不同的人、事、物在地球的彼端发生。"
      },
      {
        name: "见的世面广了，也就不会把自己局限在小格局里，"
      },
      {
        name: "不再愤世嫉俗，与人为敌。"
      },
      {
        name: "豆逼"
      },
      {
        name: "，所以，旅行永远是最好"
      },
      {
        name: "最有效的心理治疗。"
      },
      {

        name: "旅行会让人谦卑，你会知道地球之大、"
      },
      {
        name: "永远有着与你截然不同的人、事、物在地球的彼端发生。"
      },
      {
        name: "见的世面广了，也就不会把自己局限在小格局里，"
      },
      {
        name: "不再愤世嫉俗，与人为敌。"
      },
      {
        name: "豆逼"
      },
      {
        name: "，所以，旅行永远是最好"
      },
      {
        name: "最有效的心理治疗。"
      },
    ]
  },

  /**
   * 组件的方法列表
   */
  methods: {

  }
})
